[
  {
    "title": "Infrastructure & Technology",
    "location": "Montreal, CA",
    "id": "infrastructure-&-technology",
    "url": "https://ibmglobal.avature.net/en_US/careers/JobDetail?jobId=32470&source=WEB_Search_NA",
    "description": "Introduction\nIBM Quantum is an industry-first initiative to build universal quantum computers for business, engineering, and science. This effort includes advancing the entire quantum computing technology stack and exploring applications to make quantum broadly usable and accessible. With a worldwide network of Fortune 500 companies, academic institutions, researchers, educators, and enthusiasts, we are committed to driving innovation for our partners in the IBM Quantum Network and the Qiskit Community. \n Within IBM Quantum, the Quantum Innovation Centers (QIC) Team is an elite team serving our partners as they research quantum computing solutions for their most pressing business challenges. \nWe keep our partners up to date with the latest technical advances, and make sure they are empowered to use our software and services. We engage with our partners on strategic topics ranging from setting up education curriculums to organizing hackathons to industry outreach to building national ecosystems. \n The Quantum Innovation Centers (QICs) are a large subset of premium partners with efforts across the four ecosystem pillars: Quantum as a tool, Workforce and Enablement, R&D and Economic Impact. In the role of the Partnership Manager, you will be a part of this team and will be responsible for the success of partnerships across Canada.  You will be given significant autonomy and flexibility in the performance of your role and are expected to make meaningful contributions to our business and partners’ success. \nYour role and responsibilities\nAct as a primary point of contact throughout the partner life cycle, driving successful partnerships and project management with clear deliverables for several partners in Canada \nManage partner relationships and our technical leads across engagements \nNetwork within accounts to build relationships to achieve partner success and partner milestones \nBe the voice of the partner internally at IBM Quantum to improve products, offerings, and overall partner ecosystem \nBuild roadmaps tailored to the partner level to execute project delivery and strategic initiatives \nDeliver workshops and trainings, act as a champion on quantum computing topics  \nCoordinate research, training, support, and enablement and create assets for scalable future engagements \n Successful attributes \nCreative in framing and solving complex problems \nAbility to navigate through complex stakeholder management in sometimes deeply technical environments. You will need to work with, for example, senior executives at our partnerships and within IBM, academic researchers, the product organization, marketing, and salespeople \nPro-active, and agile in navigating a complex matrix organization \nOrganized, with exceptional project management skills \nQuick learner with an independent growth mindset. Able to absorb new technical concepts quickly and thoroughly \nSkilled at fostering teamwork  \nKnowledge in making data driven decisions and deep analytical thinking\nRequired education\nMaster's Degree\nPreferred education\nDoctorate Degree\nRequired technical and professional expertise\nMasters, or other advanced degrees in STEM \n3+ years of experience in business or technology strategy consulting or similar experience, with demonstrably successful interactions with clients \nProject management skills with a commitment to be highly organized and determination to meet deadlines \nExperience with relationship building, negotiation skills, client management and stakeholder management\nExceptional organizational, presentation, and communication skills, both verbal and written\nPreferred technical and professional experience\nPhD in STEM\nExperience with quantum computing \nExperience with data analytics \nThe expected location is Montreal, QC, Canada.\nABOUT BUSINESS UNIT\nIBM Research is the organic growth engine of IBM and an innovation engine for our customers and partners. As part of this mission, IBM Research anticipates and examines 'What's Next in Computing' to ultimately create and integrate the technologies the world relies upon to solve big challenges and unlock new opportunities. We create and pioneer new markets for IBM, our partners and customers as exemplified in our ongoing quest to reach practical and large-scale quantum computing. Across IBM Research, we realize the power and potential to accelerate discovery with our partners and clients by combining the power of high performance computing, AI, and Quantum, all integrated through the hybrid cloud.\nYOUR LIFE @ IBM\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\nBeing an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n  Our IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n  Are you ready to be an IBMer?\nABOUT IBM\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n  Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. \n  At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\nIBM is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, caste, genetics, pregnancy, disability, neurodivergence, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
    "requirements": "Not available",
    "category": "Not specified",
    "department": "s\nEntry Level\nResources\nLogin",
    "deadline": "Not specified",
    "job_id": "32470",
    "application_url": "https://ibmglobal.avature.net/en_US/careers/JobDetail?jobId=32470&source=WEB_Search_NA",
    "date_scraped": "2025-08-25T19:12:02.441Z"
  }
]