[
  {
    "title": "Research",
    "location": "IBM Quantum Developer Advocate EMEA",
    "id": "research",
    "url": "https://ibmglobal.avature.net/en_US/careers/JobDetail?jobId=50523&source=WEB_Search_NA",
    "description": "Introduction\nAt IBM Quantum, our mission is to bring useful quantum computing to the world. IBM brings the most performant quantum computers and enables the quantum community to develop early quantum computing use cases with the Qiskit software stack. Today, our IBM Quantum Network comprises 275+ Fortune 500 companies, academic institutions, national laboratories, and startups, all striving toward the common goal of extracting value from quantum computers. IBM is driving this technology forward along an ambitious roadmap aimed at demonstrating quantum advantage by end of 2026, delivering the first fault-tolerant quantum computing by 2029. We hope you'll join us on this mission.\nYour role and responsibilities\nWe are seeking a passionate and technically skilled Quantum Developer Advocate to join our team and help grow and enable a vibrant ecosystem around our quantum computing platform. This role sits at the intersection of enablement, education, and community engagement—ideal for someone who thrives on explaining complex concepts, supporting researchers and developers, and accelerating adoption of quantum computing.\nAs a Quantum Developer Advocate, you will work closely with quantum researchers, software developers, educators, and the open-source community. You’ll represent the voice of users internally and bring the company’s latest capabilities to the world through workshops, events, tutorials, and more. In this role, you will take the lead in advancing some of our workforce development and community initiatives in collaboration with our partners in the EMEA region, with a particular focus in Spain. \nThis role will give you the opportunity to shape the quantum education strategy across multiple ecosystems. You must be passionate not only for technology but also for connecting people and seeing individuals grow within our community. The ideal candidate must also possess communication skills appropriate for engaging scientists and developers while teaching complex concepts to a technical audience. You will liaise with numerous internal and external stakeholders and tackle complex problems which will often involve several teams, while still being able to operate independently to prioritize tasks effectively.   \n  Develop tailored strategy to deliver unique and scalable quantum education programs adapted to our partners and local communities’ needs.\nDrive IBM Quantum’s workforce development initiatives for educators, researchers, developers, and students.\nDeliver technical lectures for a wide audience, ranging from beginners to experts.\nConstantly enhance your quantum computing knowledge to build a diverse portfolio of lectures and tutorials based on the latest Qiskit tools and features.\nCollaborate with internal and external stakeholders to define and achieve goals.\nStay up to date with the latest developments in the quantum computing field, both within IBM and externally.\n    Key Responsibilities\n·       Educate and empower partners and regional ecosystems to use real quantum computers using Qiskit through high-quality tutorials, workshops, and example quantum algorithms and applications.\n·       Engage with academic and developer communities online (GitHub, Discord, Slack, forums) and in person (hackathons, challenges, developer conferences and meetups).\n·       Collect feedback and pain points from users and relay actionable insights to engineering and product teams.\n·       Represent IBM Quantum at conferences, webinars, and academic or industry events.\n  ·       Support strategic partners adopting quantum computing as a tool for scientific discovery.\nRequired education\nMaster's Degree\nPreferred education\nDoctorate Degree\nRequired technical and professional expertise\nMasters in a relevant field such as physics, mathematics, or computer science, with a strong foundation in quantum mechanics and/or quantum computing.\nIn-depth knowledge of quantum computing, including near-term algorithms, hardware and software capabilities (e.g., dynamical decoupling, readout correction, twirling, error mitigation, error correction, etc.).\nExperience in Qiskit SDK, demonstrated through scientific publications or contributions on platforms such as GitHub.\nExperience designing and delivering technical talks or workshops.\n Strong communication skills, both written and verbal.\nPreferred technical and professional experience\nPhD in physics, mathematics, or computer science, in the areas of quantum computing or quantum technologies.\nActive involvement in developer or academic communities.\nExperience contributing to or managing open-source projects is a plus.\nExperience in developer relations, technical advocacy, SW engineering, is a plus.\nExperience in teaching is a plus.\nResidency in Spain or willingness to relocate to Spain.\nFluency in Spanish.\nABOUT BUSINESS UNIT\nIBM Research is the organic growth engine of IBM and an innovation engine for our customers and partners. As part of this mission, IBM Research anticipates and examines 'What's Next in Computing' to ultimately create and integrate the technologies the world relies upon to solve big challenges and unlock new opportunities. We create and pioneer new markets for IBM, our partners and customers as exemplified in our ongoing quest to reach practical and large-scale quantum computing. Across IBM Research, we realize the power and potential to accelerate discovery with our partners and clients by combining the power of high performance computing, AI, and Quantum, all integrated through the hybrid cloud.\nYOUR LIFE @ IBM\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\nBeing an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n  Our IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n  Are you ready to be an IBMer?\nABOUT IBM\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.",
    "requirements": "Not available",
    "category": "Not specified",
    "department": "s\nEntry Level\nResources\nLogin",
    "deadline": "Not specified",
    "job_id": "50523",
    "application_url": "https://ibmglobal.avature.net/en_US/careers/JobDetail?jobId=50523&source=WEB_Search_NA",
    "date_scraped": "2025-09-05T11:01:56.315Z"
  }
]